Revit 2026 API

# ElectricalSystemApparentLoadPhaseA Property

---

The ApparentLoadPhaseA value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ApparentLoadPhaseA { get; }
```
```vb
Public ReadOnly Property ApparentLoadPhaseA As Double
	Get
```
```cpp
public:
property double ApparentLoadPhaseA {
	double get ();
}
```
```fsharp
member ApparentLoadPhaseA : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the ApparentLoadPhaseA value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace